Revit 2020 API
RouteAnalysisSettings.GetIgnoredCategoryIds Method
 Returns ElementIds for Category elements which are ignored by route calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Syntax
C#
public ICollection<ElementId> GetIgnoredCategoryIds()
Visual Basic
Public Function GetIgnoredCategoryIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetIgnoredCategoryIds()
Return Value
 The ids of Categories which are ignored by route calculation. Default set contains the Door Category.
See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace